/*xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx*/
/*																														*/
/*														 ìGÉZÉbÉg èàóù													*/
/*																														*/
/*xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx*/

/* ____ INCLUDE ____ */
#include <windows.h>
#include "Def.h"
#include "Work.h"

int EneSet2[][8] = {
/*
	0: enemy count
	1: ID  2: Sporn.xpos  3: S.ypos  4: S.xspd  5: S.yspd  6: flg  7: color
*/
//	   0 |	  1	   |   2  |  3	|  4  |  5  | 6 | 7
	{  1 , ID_ENE6 ,  250 ,   0 ,   0 ,  10 , 0 , 2 } ,				// ENEMY6	â©êF
	{  1 , ID_ENE6 ,  550 ,   0 ,   0 ,  10 , 0 , 2 } ,				// ENEMY6	â©êF
	{  1 ,		 0 ,    0 ,   0 ,   0 ,   0 , 0 , 0 } ,				// Ç»Çµ
	{  1 , ID_ENE7 ,  -50 , 500 ,   8 , -15 , 1 , 1 } ,				// ENEMY7	óŒêF	ç∂Ç©ÇÁ
	{  1 ,		 0 ,    0 ,   0 ,   0 ,   0 , 0 , 0 } ,				// Ç»Çµ
	{  1 ,		 0 ,    0 ,   0 ,   0 ,   0 , 0 , 0 } ,				// Ç»Çµ
	{  1 ,		 0 ,    0 ,   0 ,   0 ,   0 , 0 , 0 } ,				// Ç»Çµ
	{  1 ,		 0 ,    0 ,   0 ,   0 ,   0 , 0 , 0 } ,				// Ç»Çµ
	{  1 ,		 0 ,    0 ,   0 ,   0 ,   0 , 0 , 0 } ,				// Ç»Çµ
	{  1 ,		 0 ,    0 ,   0 ,   0 ,   0 , 0 , 0 } ,				// Ç»Çµ
	{  1 , ID_ENE7 ,  -50 , 500 ,   8 , -15 , 1 , 2 } ,				// ENEMY7	â©êF	ç∂Ç©ÇÁ
	{  1 ,		 0 ,    0 ,   0 ,   0 ,   0 , 0 , 0 } ,				// Ç»Çµ
	{  1 ,		 0 ,    0 ,   0 ,   0 ,   0 , 0 , 0 } ,				// Ç»Çµ
	{  1 ,		 0 ,    0 ,   0 ,   0 ,   0 , 0 , 0 } ,				// Ç»Çµ
	{  1 ,		 0 ,    0 ,   0 ,   0 ,   0 , 0 , 0 } ,				// Ç»Çµ
	{  1 ,		 0 ,    0 ,   0 ,   0 ,   0 , 0 , 0 } ,				// Ç»Çµ
	{  1 ,		 0 ,    0 ,   0 ,   0 ,   0 , 0 , 0 } ,				// Ç»Çµ
	{  1 , ID_ENE7 ,  -50 , 500 ,   8 , -15 , 1 , 0 } ,				// ENEMY7	ê‘êF	ç∂Ç©ÇÁ
	{  1 ,		 0 ,    0 ,   0 ,   0 ,   0 , 0 , 0 } ,				// Ç»Çµ
	{  1 ,		 0 ,    0 ,   0 ,   0 ,   0 , 0 , 0 } ,				// Ç»Çµ
	{  1 ,		 0 ,    0 ,   0 ,   0 ,   0 , 0 , 0 } ,				// Ç»Çµ
	{  1 ,		 0 ,    0 ,   0 ,   0 ,   0 , 0 , 0 } ,				// Ç»Çµ
	{  1 ,		 0 ,    0 ,   0 ,   0 ,   0 , 0 , 0 } ,				// Ç»Çµ
	{  1 ,		 0 ,    0 ,   0 ,   0 ,   0 , 0 , 0 } ,				// Ç»Çµ
	{  1 , ID_ENE7 ,  -50 , 500 ,   8 , -15 , 1 , 1 } ,				// ENEMY7	óŒêF	ç∂Ç©ÇÁ
	{  1 ,		 0 ,    0 ,   0 ,   0 ,   0 , 0 , 0 } ,				// Ç»Çµ
	{  1 ,		 0 ,    0 ,   0 ,   0 ,   0 , 0 , 0 } ,				// Ç»Çµ
	{  1 ,		 0 ,    0 ,   0 ,   0 ,   0 , 0 , 0 } ,				// Ç»Çµ
	{  1 ,		 0 ,    0 ,   0 ,   0 ,   0 , 0 , 0 } ,				// Ç»Çµ
	{  1 ,		 0 ,    0 ,   0 ,   0 ,   0 , 0 , 0 } ,				// Ç»Çµ
	{  1 ,		 0 ,    0 ,   0 ,   0 ,   0 , 0 , 0 } ,				// Ç»Çµ
	{  1 , ID_ENE7 ,  -50 , 500 ,   8 , -15 , 1 , 2 } ,				// ENEMY7	â©êF	ç∂Ç©ÇÁ
	{  1 ,		 0 ,    0 ,   0 ,   0 ,   0 , 0 , 0 } ,				// Ç»Çµ
	{  1 ,		 0 ,    0 ,   0 ,   0 ,   0 , 0 , 0 } ,				// Ç»Çµ
	{  1 ,		 0 ,    0 ,   0 ,   0 ,   0 , 0 , 0 } ,				// Ç»Çµ
	{  1 ,		 0 ,    0 ,   0 ,   0 ,   0 , 0 , 0 } ,				// Ç»Çµ
	{  1 ,		 0 ,    0 ,   0 ,   0 ,   0 , 0 , 0 } ,				// Ç»Çµ
	{  1 ,		 0 ,    0 ,   0 ,   0 ,   0 , 0 , 0 } ,				// Ç»Çµ
	{  1 , ID_ENE7 ,  -50 , 500 ,   8 , -15 , 1 , 0 } ,				// ENEMY7	ê‘êF	ç∂Ç©ÇÁ
	{  1 ,		 0 ,    0 ,   0 ,   0 ,   0 , 0 , 0 } ,				// Ç»Çµ
	{  1 ,		 0 ,    0 ,   0 ,   0 ,   0 , 0 , 0 } ,				// Ç»Çµ
	{  1 ,		 0 ,    0 ,   0 ,   0 ,   0 , 0 , 0 } ,				// Ç»Çµ
	{  1 ,		 0 ,    0 ,   0 ,   0 ,   0 , 0 , 0 } ,				// Ç»Çµ
	{  1 ,		 0 ,    0 ,   0 ,   0 ,   0 , 0 , 0 } ,				// Ç»Çµ
	{  1 ,		 0 ,    0 ,   0 ,   0 ,   0 , 0 , 0 } ,				// Ç»Çµ
	{  1 , ID_ENE7 ,  850 , 500 ,  -8 , -15 , 1 , 1 } ,				// ENEMY7	óŒêF	âEÇ©ÇÁ -------------------
	{  1 ,		 0 ,    0 ,   0 ,   0 ,   0 , 0 , 0 } ,				// Ç»Çµ
	{  1 ,		 0 ,    0 ,   0 ,   0 ,   0 , 0 , 0 } ,				// Ç»Çµ
	{  1 ,		 0 ,    0 ,   0 ,   0 ,   0 , 0 , 0 } ,				// Ç»Çµ
	{  1 ,		 0 ,    0 ,   0 ,   0 ,   0 , 0 , 0 } ,				// Ç»Çµ
	{  1 ,		 0 ,    0 ,   0 ,   0 ,   0 , 0 , 0 } ,				// Ç»Çµ
	{  1 ,		 0 ,    0 ,   0 ,   0 ,   0 , 0 , 0 } ,				// Ç»Çµ
	{  1 , ID_ENE7 ,  850 , 500 ,  -8 , -15 , 1 , 2 } ,				// ENEMY7	â©êF	âEÇ©ÇÁ
	{  1 ,		 0 ,    0 ,   0 ,   0 ,   0 , 0 , 0 } ,				// Ç»Çµ
	{  1 ,		 0 ,    0 ,   0 ,   0 ,   0 , 0 , 0 } ,				// Ç»Çµ
	{  1 ,		 0 ,    0 ,   0 ,   0 ,   0 , 0 , 0 } ,				// Ç»Çµ
	{  1 ,		 0 ,    0 ,   0 ,   0 ,   0 , 0 , 0 } ,				// Ç»Çµ
	{  1 ,		 0 ,    0 ,   0 ,   0 ,   0 , 0 , 0 } ,				// Ç»Çµ
	{  1 ,		 0 ,    0 ,   0 ,   0 ,   0 , 0 , 0 } ,				// Ç»Çµ
	{  1 , ID_ENE7 ,  850 , 500 ,  -8 , -15 , 1 , 0 } ,				// ENEMY7	ê‘êF	âEÇ©ÇÁ
	{  1 ,		 0 ,    0 ,   0 ,   0 ,   0 , 0 , 0 } ,				// Ç»Çµ
	{  1 ,		 0 ,    0 ,   0 ,   0 ,   0 , 0 , 0 } ,				// Ç»Çµ
	{  1 ,		 0 ,    0 ,   0 ,   0 ,   0 , 0 , 0 } ,				// Ç»Çµ
	{  1 ,		 0 ,    0 ,   0 ,   0 ,   0 , 0 , 0 } ,				// Ç»Çµ
	{  1 ,		 0 ,    0 ,   0 ,   0 ,   0 , 0 , 0 } ,				// Ç»Çµ
	{  1 ,		 0 ,    0 ,   0 ,   0 ,   0 , 0 , 0 } ,				// Ç»Çµ
	{  1 , ID_ENE7 ,  850 , 500 ,  -8 , -15 , 1 , 1 } ,				// ENEMY7	óŒêF	âEÇ©ÇÁ
	{  1 ,		 0 ,    0 ,   0 ,   0 ,   0 , 0 , 0 } ,				// Ç»Çµ
	{  1 ,		 0 ,    0 ,   0 ,   0 ,   0 , 0 , 0 } ,				// Ç»Çµ
	{  1 ,		 0 ,    0 ,   0 ,   0 ,   0 , 0 , 0 } ,				// Ç»Çµ
	{  1 ,		 0 ,    0 ,   0 ,   0 ,   0 , 0 , 0 } ,				// Ç»Çµ
	{  1 ,		 0 ,    0 ,   0 ,   0 ,   0 , 0 , 0 } ,				// Ç»Çµ
	{  1 ,		 0 ,    0 ,   0 ,   0 ,   0 , 0 , 0 } ,				// Ç»Çµ
	{  1 , ID_ENE7 ,  850 , 500 ,  -8 , -15 , 1 , 2 } ,				// ENEMY7	â©êF	âEÇ©ÇÁ
	{  1 ,		 0 ,    0 ,   0 ,   0 ,   0 , 0 , 0 } ,				// Ç»Çµ
	{  1 ,		 0 ,    0 ,   0 ,   0 ,   0 , 0 , 0 } ,				// Ç»Çµ
	{  1 ,		 0 ,    0 ,   0 ,   0 ,   0 , 0 , 0 } ,				// Ç»Çµ
	{  1 ,		 0 ,    0 ,   0 ,   0 ,   0 , 0 , 0 } ,				// Ç»Çµ
	{  1 ,		 0 ,    0 ,   0 ,   0 ,   0 , 0 , 0 } ,				// Ç»Çµ
	{  1 ,		 0 ,    0 ,   0 ,   0 ,   0 , 0 , 0 } ,				// Ç»Çµ
	{  1 , ID_ENE7 ,  850 , 500 ,  -8 , -15 , 1 , 0 } ,				// ENEMY7	ê‘êF	âEÇ©ÇÁ
	{  1 ,		 0 ,    0 ,   0 ,   0 ,   0 , 0 , 0 } ,				// Ç»Çµ
	{  1 ,		 0 ,    0 ,   0 ,   0 ,   0 , 0 , 0 } ,				// Ç»Çµ
	{  1 ,		 0 ,    0 ,   0 ,   0 ,   0 , 0 , 0 } ,				// Ç»Çµ
	{  1 ,		 0 ,    0 ,   0 ,   0 ,   0 , 0 , 0 } ,				// Ç»Çµ
	{  1 ,		 0 ,    0 ,   0 ,   0 ,   0 , 0 , 0 } ,				// Ç»Çµ
	{  1 ,		 0 ,    0 ,   0 ,   0 ,   0 , 0 , 0 } ,				// Ç»Çµ
	{ -1 ,		 0 ,	0 ,   0 ,   0 ,   0 , 0 , 0 } ,				// ÉZÉbÉgèIóπ
} ;

/*______________________________________________________*/
/*						 EnemyÉZÉbÉg2					*/
/*ÅPÅPÅPÅPÅPÅPÅPÅPÅPÅPÅPÅPÅPÅPÅPÅPÅPÅPÅPÅPÅPÅPÅPÅPÅPÅPÅP*/
void ActEnemySet2( void )
{
	int no ;

	if ( EneSet2[ecount[1]][0] != -1 )
	{
		no = ObjSearch( O_ENE , MAX_ENE ) ;
		if ( no != -1 )
		{
			obj[no].idnum = EneSet2[ecount[1]][1] ;
			obj[no].mode = 0 ;
			obj[no].xpos = (double)EneSet2[ecount[1]][2] ;
			obj[no].ypos = (double)EneSet2[ecount[1]][3] ;
			obj[no].xspd = (double)EneSet2[ecount[1]][4] ;
			obj[no].yspd = (double)EneSet2[ecount[1]][5] ;
			obj[no].flg = EneSet2[ecount[1]][6] ;
			obj[no].color = EneSet2[ecount[1]][7] ;
		}
		ecount[1]++ ;
	}

}


